const messages = [
  {
    date: '2022/12/26 14:22:00',
    content:
      '我应该去追寻某些让我一直投入的东西，不是追求成功，而是追求自己的自身成长 —— <a href="https://survivesjtu.gitbook.io/survivesjtumanual/fu-lu/ben-ke-sheng-zhuan-ye-jie-shao-todo/cs-zi-jiu-zhi-bei">CS自救指北</a>  ',
  },
  {
    date: '2022/12/25 20:13:28',
    content:
      '推迟数据库的细节设计是不常见但推荐的做法，通过等待，避免了将过多的基础结构放入数据库，我们更愿意仅仅实现刚好满足应用程序需要的数据库功能',
  },
  {
    date: '2022/12/23 11:14:25',
    content:
      '比起在垃圾代码上开发新东西，我更喜欢找垃圾代码中的 bug 并吐槽（还是实践经验太少了，虽然愿意去读代码，但是非常不愿意改）',
  },
  {
    date: '2022/12/17 00:35:01',
    content: '有食欲是多么幸福的一件事情',
  },
  {
    date: '2022/12/07 11:31:57',
    content: '最近的快乐：看官方文档以及查官方文档。',
  },
  {
    date: '2022/12/04 14:03:30',
    content:
      '昨晚做饭突然厨卫的插座没电了，今早打电话给物业让电工师傅来修，一进来说应该是跳闸了，这才缓缓打开家里的配电箱，确实是，昨晚一直没想到家里的配电箱，看着门外的电表没跳闸就以为不是跳闸的问题是电路的问题。租房还是要知道一下家里的配电箱。',
  },
  {
    date: '2022/12/02 18:36:34',
    content:
      '“光知道还不够，还必须付诸应用；光有决心还不够，还必须行动。” —— 李小龙',
  },
  {
    date: '2022/11/29 15:33:41',
    content: '生命不止，学习不止，学习也成为了逃避生活困难的一种方式。',
  },
  {
    date: '2022/11/28 13:46:18',
    content: '！！！居然有一根白头发了，OMG',
  },
  {
    date: '2022/11/24 10:21:28',
    content: '“一个只关心自己的人不足以成大器。” —— 本杰明• 富兰克林',
  },
  {
    date: '2022/11/24 09:46:14',
    content:
      '工作大部分没做完汇报做完了，开会表现出来一切都游刃有余的样子，一切都是正常的样子，真的牛批，领导也不知道具体工作任务，疯狂安排任务，难免变成效率低下的团队。我想到的处理办法也只有逃离了，因为我觉得我还没有本领给出特别好的建议。',
  },
  {
    date: '2022/11/22 23:06:49',
    content:
      '感觉一年多没写 python 了，工具突然又多超级多，超想学，不过没时间，工作都应付不过来',
  },
  {
    date: '2022/11/16 17:20:12',
    content:
      '本应该做好的最简单的事情，做成时不值得欢呼雀跃，时刻警醒自己，提高对自己的要求',
  },
  {
    date: '2022/11/10 14:41:00',
    content: '“哪里有天才，我是把别人喝咖啡的工夫都用在了工作上了。“ ——  鲁迅',
  },
  {
    date: '2022/11/08 12:21:37',
    content:
      '不做出突破，不走出舒适圈永远成长不了（一直写垃圾代码，不去优化代码的就是屑）',
  },
];
window.addEventListener('load', (event) => {
  let html = '';
  for (const [index, message] of Object.entries(messages)) {
    html += `
      <div class="container ${index % 2 === 0 ? 'left' : 'right'}">
    <div class="date">${message.date}</div>
    <div class="content">
      <p>
       ${message.content}
      </p>
    </div>
  </div>
    `;
  }

  const element = document.getElementById('timeline');
  element.innerHTML = html;
});
